{
  "basics": {
    "name": "Haotian XIE",
    "email": "haotian.xie@rutgers.edu",
    "location": {
      "address": "55 Rockafeller Rd",
      "postalCode": "NJ 08854",
      "city": "Piscataway",
      "countryCode": "US",
      "region": "New Jersey"
    }
  },
  "work": [
    {
      "name": "Autra.tech",
      "position": "Infrastructure Engineer",
      "url": "https://autra.tech",
      "startDate": "2023-01",
      "endDate": "2023-12",
      "highlights": [
        "Hybrid Cloud Object Storage System: Formulated metadata-driven strategies for atomic operations on datasets (a collection of files), enabling tiered storage without compromising data integrity or atomicity. Allowed users to use remote object storage as a mounted directory. Realized an 80% cost reduction in storage.",
        "Hybrid Cloud Resource Management System: Implemented a GitOps approval-release process based on Terraform and GitHub webhooks, enabling real-time, minute-level adjustments to cloud resources in a hundred-machines cluster. Achieved a 10% cost reduction in cloud resources expenditures.",
        "Module Package Manager for Autonomous Driving System: Established Bazel-based binary packaging rules and developed a package tool for binary package version control, enabling effective decoupling of various modules within the autonomous driving system, resulting in faster development cycles and more efficient CI/CD pipelines."
      ]
    },
    {
      "name": "Pony.ai",
      "position": "Infrastructure Engineer",
      "url": "https://pony.ai",
      "startDate": "2022-05",
      "endDate": "2022-11",
      "highlights": [
        "Automatic Virtual Machines Creation Pipeline: Designed and implemented an automated system for creating virtual machine, featuring resource and IP pre-allocation tailored to user needs. Successfully managed the large-scale deployment of several hundred machines. Reduced the deployment time to minutes while maintaining 99% reliability.",
        "Kubernetes Eviction Policies for Autonomous Driving Workloads: Developed a disk space-based job queuing system to prioritize pod retention. Addressed limitations in default Kubernetes eviction policies and better aligning with training system requirements.",
        "Automatic Certificates Management System: Utilized Argo workflow, Jira webhooks, Grafana, and Vault to automate monitoring, alerting, and renewal of all certificates. Enhanced management efficiency and minimizing security risks due to certificate expiration."
      ]
    },
    {
      "name": "Pony.ai",
      "position": "Intern of Infrastructure Engineer",
      "url": "https://pony.ai",
      "startDate": "2021-06",
      "endDate": "2021-12",
      "highlights": [
        "Configuration Management Database (CMDB): Developed and deployed a centralized CMDB system to manage over a thousand servers, streamlining the procurement-to-delivery workflow and significantly enhancing operational efficiency and asset tracking.",
        "Automatic Hardware Data Collection System with Network Topology Generation: Implemented an automation framework using Ansible and Argo Workflow for hardware data collection and network topology mapping. Enriched existing CMDB data and improved asset management and network visibility."
      ]
    }
  ],
  "education": [
    {
      "institution": "the Chinese University of Hong Kong, Shenzhen",
      "url": "https://www.cuhk.edu.cn/en",
      "area": "Computer Sciences and Engineering",
      "studyType": "Bachelor of Engineering",
      "startDate": "2018-09",
      "endDate": "2022-05"
    }
  ],
  "skills": [
    {
      "name": "Python",
      "icon": "fa-solid fa-tag"
    },
    {
      "name": "Rust",
      "icon": "fa-solid fa-tag"
    },
    {
      "name": "C/C++(20)",
      "icon": "fa-solid fa-tag"
    },
    {
      "name": "Kubernetes",
      "icon": "fa-solid fa-tag"
    },
    {
      "name": "Argo Workflow",
      "icon": "fa-solid fa-tag"
    },
    {
      "name": "Bazel",
      "icon": "fa-solid fa-tag"
    },
    {
      "name": "IaaS",
      "icon": "fa-solid fa-tag"
    },
    {
      "name": "Object Storage",
      "icon": "fa-solid fa-tag"
    }
  ],
  "languages": [
    {
      "language": "Chinese",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    }
  ]
}
